##### -- Create the Housing_Unit_Status Table

In [5]:
%%bigquery
create table acs_2018_modeled.Housing_Unit_Status as
select distinct NAME, DP04_0001E, 
cast(replace(DP04_0002PE, '-', '0') as FLOAT64) as DP04_0002PE, 
cast(replace(DP04_0003PE, '-', '0') as FLOAT64) as DP04_0003PE,
DP04_0006E
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

##### -- Create Housing_Unit table

In [17]:
%%bigquery
create table acs_2018_modeled.Housing_Unit as
select distinct NAME, 
cast(replace(DP04_0007PE, '-', '0') as FLOAT64) as DP04_0007PE, 
cast(replace(DP04_0008PE, '-', '0') as FLOAT64) as DP04_0008PE,
cast(replace(DP04_0009PE, '-', '0') as FLOAT64) as DP04_0009PE, 
cast(replace(DP04_0010PE, '-', '0') as FLOAT64) as DP04_0010PE, 
cast(replace(DP04_0011PE, '-', '0') as FLOAT64) as DP04_0011PE, 
cast(replace(DP04_0012PE, '-', '0') as FLOAT64) as DP04_0012PE,
cast(replace(DP04_0013PE, '-', '0') as FLOAT64) as DP04_0013PE, 
cast(replace(DP04_0014PE, '-', '0') as FLOAT64) as DP04_0014PE, 
cast(replace(DP04_0015PE, '-', '0') as FLOAT64) as DP04_0015PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

##### -- Create Built_year table

In [21]:
%%bigquery
create table acs_2018_modeled.Built_year as
select distinct NAME, 
cast(replace(DP04_0017PE, '-', '0') as FLOAT64) as DP04_0017PE, 
cast(replace(DP04_0018PE, '-', '0') as FLOAT64) as DP04_0018PE,
cast(replace(DP04_0019PE, '-', '0') as FLOAT64) as DP04_0019PE, 
cast(replace(DP04_0020PE, '-', '0') as FLOAT64) as DP04_0020PE, 
cast(replace(DP04_0021PE, '-', '0') as FLOAT64) as DP04_0021PE, 
cast(replace(DP04_0022PE, '-', '0') as FLOAT64) as DP04_0022PE,
cast(replace(DP04_0023PE, '-', '0') as FLOAT64) as DP04_0023PE, 
cast(replace(DP04_0024PE, '-', '0') as FLOAT64) as DP04_0024PE, 
cast(replace(DP04_0025PE, '-', '0') as FLOAT64) as DP04_0025PE, 
cast(replace(DP04_0026PE, '-', '0') as FLOAT64) as DP04_0026PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

##### -- Create Housing_Value table

In [24]:
%%bigquery
create table acs_2018_modeled.Housing_Value as
select distinct NAME, 
cast(replace(DP04_0081PE, '-', '0') as FLOAT64) as DP04_0081PE, 
cast(replace(DP04_0082PE, '-', '0') as FLOAT64) as DP04_0082PE,
cast(replace(DP04_0083PE, '-', '0') as FLOAT64) as DP04_0083PE, 
cast(replace(DP04_0084PE, '-', '0') as FLOAT64) as DP04_0084PE, 
cast(replace(DP04_0085PE, '-', '0') as FLOAT64) as DP04_0085PE, 
cast(replace(DP04_0086PE, '-', '0') as FLOAT64) as DP04_0086PE,
cast(replace(DP04_0087PE, '-', '0') as FLOAT64) as DP04_0087PE, 
cast(replace(DP04_0088PE, '-', '0') as FLOAT64) as DP04_0088PE
from acs_2018_staging.housing
where NAME is not null

Empty DataFrame
Columns: []
Index: []

##### -- Create PrivatePublic_School_Enrollment table

In [1]:
%%bigquery
create table acs_2018_modeled.PrivatePublic_School_Enrollment as
select distinct NAME, 
S1401_C03_008E, 
S1401_C05_008E,
S1401_C03_009E, 
S1401_C05_009E
from acs_2018_staging.school_enrollment
where NAME is not null

Empty DataFrame
Columns: []
Index: []

##### -- Create General_School_Enrollment table

In [4]:
%%bigquery
create table acs_2018_modeled.General_School_Enrollment as
select distinct NAME, 
S1401_C01_004E, 
S1401_C01_005E, 
S1401_C01_006E, 
S1401_C01_007E, 
S1401_C01_008E,
S1401_C01_009E
from acs_2018_staging.school_enrollment
where NAME is not null

Empty DataFrame
Columns: []
Index: []

In [4]:
%%bigquery
select i.ZCTA5, Predominant_Class , College_Undergrad_Public, College_Undergrad_Private
from acs_2018_modeled.Income_Beam_DF i join acs_2018_modeled.PrivatePublic_School_Enrollment_Beam_DF s
on i.ZCTA5 = s.ZCTA5
where College_Undergrad_Public <> 0 and College_Undergrad_Private <> 0
order by College_Undergrad_Private desc
limit 20

,ZCTA5,Predominant_Class,College_Undergrad_Public,College_Undergrad_Private
0,19104,Lowest,2029,17773
1,13210,Lowest,2251,11614
2,90007,Lowest,2938,8817
3,76706,Lowest,1948,8433
4,83440,Lowest,2260,8213
5,10027,Lowest,2187,6654
6,77004,Lowest,5018,5810
7,94305,Lower_Middle,1716,5520
8,46556,Lowest,414,5312
9,10458,Lowest,3932,4457
10,06511,Lowest,1998,4397
11,02120,Lowest,470,4222
12,01610,Lowest,1764,4110
13,60637,Lowest,2128,4080
14,01609,Lowest,1351,4053
15,21218,Lowest,3112,4004
16,30314,Lowest,2693,3948
17,72143,Middle,812,3883
18,24501,Lowest,888,3810
19,00926,Lowest,2874,3807

In [5]:
%%bigquery
select count(Predominant_Class) as Count_of_class, Predominant_Class
from acs_2018_modeled.Income_Beam_DF i join acs_2018_modeled.Housing_Value_Beam_DF h
on i.ZCTA5 = h.ZCTA5
where High_Housing_Value <> 0 and Middle_Housing_Value <> 0 and Low_Housing_Value <> 0
group by Predominant_Class

   Count_of_class Predominant_Class
0            2290            Lowest
1             423            Middle
2             295      Lower_Middle
3              20      Upper_Middle
4               1              Rich

In [7]:
%%bigquery
select b.*, High_Housing_Value
from acs_2018_modeled.Built_Year_Beam_DF b join acs_2018_modeled.Housing_Value_Beam_DF h
on b.ZCTA5 = h.ZCTA5
where High_Housing_Value <> 0 and Middle_Housing_Value <> 0 and Low_Housing_Value <> 0
order by High_Housing_Value desc
limit 20

,ZCTA5,Built_2014_or_later,Built_2010_to_2013,Built_2000_to_2009,Built_1990_to_1999,Built_1980_to_1989,Built_1970_to_1979,Built_1960_to_1969,Built_1950_to_1959,Built_1940_to_1949,Built_1939_or_before,High_Housing_Value
0,90402,1.2,1.3,5.8,6.9,4.4,17.3,8.2,13.1,11.9,29.8,98.7
1,94024,1.1,1.8,6.3,5.9,5.9,11.4,18.9,37.5,8.8,2.5,98.0
2,94957,1.3,4.8,1.3,6.6,6.3,6.3,2.8,21.0,6.1,43.5,97.7
3,94127,0.0,0.2,1.0,1.7,2.4,3.1,8.7,16.6,11.3,55.0,97.5
4,94087,0.9,0.4,3.8,4.9,8.6,20.5,30.7,26.6,2.6,1.0,97.3
5,92625,2.2,2.1,10.2,9.4,9.2,22.1,21.7,12.9,7.2,2.9,97.3
6,22205,1.2,1.4,4.9,1.9,6.9,4.2,5.7,21.5,36.2,16.1,97.2
7,95130,0.2,0.0,3.4,2.7,4.5,17.0,37.5,33.0,1.2,0.5,97.1
8,02468,0.0,0.5,1.3,0.4,1.3,2.2,1.2,20.6,11.3,61.3,97.1
9,02493,0.2,2.7,8.8,8.7,6.5,7.3,17.7,17.6,4.0,26.6,96.9
10,96821,0.7,0.3,9.0,8.0,13.0,14.8,20.9,25.6,6.3,1.5,96.9
11,95120,0.7,0.5,2.9,9.9,19.6,37.6,23.9,2.0,1.2,1.9,96.8
12,92657,1.3,1.4,35.9,51.4,3.2,3.7,0.7,2.3,0.0,0.0,96.8
13,94070,0.4,0.3,3.5,3.4,10.2,15.4,15.6,21.8,20.3,9.2,96.7
14,94402,0.0,1.5,4.3,4.4,5.2,13.7,11.8,21.6,16.1,21.4,96.6
15,22182,0.3,1.3,12.5,20.7,24.9,28.5,8.8,1.7,0.9,0.5,96.6
16,94301,1.1,2.5,7.0,7.5,6.3,11.9,13.5,8.6,8.5,33.2,96.5
17,94549,2.0,0.6,5.0,6.0,10.2,15.8,18.7,28.3,9.7,3.5,96.5
18,92603,0.0,0.0,45.1,14.6,12.2,21.0,5.7,1.3,0.0,0.1,96.4
19,94506,1.6,2.8,15.1,41.9,33.5,3.5,0.4,0.4,0.5,0.4,96.4

In [10]:
%%bigquery
select High_Housing_Value, count(Built_2014_or_later) as num_of_highvalue_built2014_or_later
from acs_2018_modeled.Built_Year_Beam_DF b join acs_2018_modeled.Housing_Value_Beam_DF h
on b.ZCTA5 = h.ZCTA5
where High_Housing_Value <> 0 and Middle_Housing_Value <> 0 and Low_Housing_Value <> 0
group by High_Housing_Value having High_Housing_Value > 50
order by num_of_highvalue_built2014_or_later desc
limit 20

    High_Housing_Value  num_of_highvalue_built2014_or_later
0                 51.7                                    8
1                 76.1                                    8
2                 73.5                                    8
3                 54.0                                    7
4                 50.9                                    7
5                 94.0                                    6
6                 84.9                                    6
7                 57.3                                    6
8                 81.3                                    6
9                 65.4                                    6
10                92.6                                    6
11                72.0                                    6
12                78.0                                    6
13                70.6                                    6
14                71.1                                    6
15                52.2                                    6
16                70.9                                    6
17                89.9                                    6
18                95.5                                    6
19                68.3                                    6